Autodesk.Revit.DB.SolidUtils.Deserialize(System.IntPtr,System.Int32,System.Int32)
Deserializes a Solid from a byte array.
The solid to serialize.
data:
Buffer holding serialized data.
nDataOffset:
Offset to start reading from.
nDataSize:
Data size.
Returns:
The deserialized Solid.
Since:
2026

Autodesk.Revit.DB.SolidUtils.Serialize(Autodesk.Revit.DB.Solid,System.IntPtr,System.Int32)
Serializes the input Solid to a byte array.
The solid to serialize.
data:
Buffer to receive solid bytes.
nDataSize:
Available data size.
Returns:
Returns true if everything was ok, false if some issue occured.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.SolidUtils.GetSerializedDataSize(Autodesk.Revit.DB.Solid)
Computes the needed size of a buffer that could hold this solid's serialized data.
The solid to serialize.
Returns:
Necessary data size.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.SolidUtils.ComputeIsGeometricallyClosed(Autodesk.Revit.DB.Solid)
Computes whether the input Solid is geometrically closed to within Revit's tolerances.
Remarks:
A solid is geometrically closed if it is topologically closed and also meets certain
geometric criteria. In particular, every pair of faces adjoining an edge must intersect
along the edge, and edge loops must have no gaps between consecutive edges of the loop,
when evaluated on the edge loop's face.
If the geometry contains multiple connected components, the function returns true
if and only if every connected component is geometrically closed. If the input Solid
contains grossly invalid geometry, an InvalidOperationException will be thrown.
geometry:
The solid or shell geometry to test.
Returns:
True if the geometry is geometrically closed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to compute whether the geometry is geometrically closed.
Since:
2026

Autodesk.Revit.DB.SolidUtils.ComputeIsTopologicallyClosed(Autodesk.Revit.DB.Solid)
Compute whether the input Solid is topologically closed.
Remarks:
A solid is topologically closed if every face has at least one edge loop and
every edge is shared by exactly two faces. If the geometry contains multiple
connected components, the function returns true if and only if every connected
component is topologically closed.
geometry:
The solid or shell geometry to test.
Returns:
True if the geometry is topologically closed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026